rails-intro/app/controllers/movies_controller.rb

  def index
    @movies = Movie.order(params[:sort])
---
SELECT "movies".* FROM "movies" ORDER BY release_date